src/chapter_10.org
#+title:  Chapter 10
#+author: Reinhard Stahn
#+setupfile: ./inc/setupfile.org
#+include: ./inc/latex-macros.org
#+property: header-args:sage :session *sage-chapter-10* :tangle chapter_10.sage
# python session just for qiskit since sage integers dont work well with qiskit:
#+property: header-args:python :session *python-chapter-10* :tangle no

#+toc: headlines 2

* Setup
** Imports
#+name: chapter-10-imports
#+begin_src sage
  from utils_sage import ket
  from chapter_8_sage import make_operation
#+end_src

# Hidden imports
#+name: chapter-10-hidden-imports
#+begin_src python :exports none
  from qiskit.circuit import QuantumCircuit, QuantumRegister, Parameter as Param
#+end_src

** Utility code
#+name: chapter-10-global-vars
#+begin_src sage
  g = SR.var("g", domain="positive")
  a, b = SR.var("a b", domain="complex")
  assume(g <= 1)
#+end_src

** Notation
Below we use $\BB=\mathrm{GF}(2)=\ZZ_2$ to denote the field of two elements. This models a
/bit/.

* Exercises
** Exercise 10.1
Verify that the encoding circuit in Figure 10.2 works as claimed.

#+RESULTS[b2469d3d1659de6df9ffe41f5443d686897376b9]: exercise-10.1-circuit
:
: |psi>: ──■────■──
:        ┌─┴─┐  │
: |0>_0: ┤ X ├──┼──
:        └───┘┌─┴─┐
: |0>_1: ─────┤ X ├
:             └───┘


#+name: exercise-10.1-circuit
#+begin_src python :results replace :cache yes :exports results
  qr0 = QuantumRegister(1, "|psi>")
  qr1 = QuantumRegister(2, "|0>")

  qc = QuantumCircuit(qr0, qr1)
  qc.cx(0, 1)
  qc.cx(0, 2)

  qc.draw()
#+end_src

*** Solution
This is really just observing that the circuit acts like this on the /relevant/ basis
states

\begin{align*}
  \ket{000} &\mapsto \ket{000} , \\
  \ket{100} &\mapsto \ket{111} . \\
\end{align*}

The rest follows by linearity.

** Exercise 10.2
The action of the bit flip channel can be described by the quantum operation
$\calE(\rho)=(1-p)\rho+pX\rho\?X$. Show that this may be given an alternate operator-sum
representation, as $\calE(\rho)=(1-2p)\rho+2pP_+\rho\?P_++2pP_-\rho\?P_-$ where $P_+$ and
$P_-$ are projectors onto the $+1$ and $-1$ eigenstates of $X$,
$(\ket{0}+\ket{1})/\sqrt{2}$ and $(\ket{0}+\ket{1})/\sqrt{2}$ respectively.  This latter
representation can be understood as a model in which the qubit is left alone with
probability $1-2p$, and is ‘measured’ by the environment in the $\ket{+}$, $\ket{-}$ basis
with probability $2p$.

*** Proof
Note that $X=P_+-P_-$ and $I=P_++P_-$. Hence

$$
  X\rho X = P_+\rho P_+ + P_-\rho P_- - (P_+\rho P_- + P_-\rho P_+)
  = 2(P_+\rho P_+ + P_-\rho P_-) - I\rho I .
$$

Hence

$$
  \calE(\rho) = (1 - 2p)\rho + 2p (P_+\rho P_+ + P_-\rho P_-) .
$$

QED.

** Exercise 10.3
Show by explicit calculation that measuring $Z_1Z_2$ followed by $Z_2Z_3$ is equivalent,
up to labeling of the measurement outcomes, to measuring the four projectors defined by
(10.5)–(10.8), in the sense that both procedures result in the same measurement statistics
and post-measurement states.

*** Proof
Let us define the following projectors

\begin{align*}
  P_{ijk} &= \proj{i}\otimes\proj{j}\otimes\proj{k} , \\
  P_{ijx} &= \proj{i}\otimes\proj{j}\otimes I , \\
  P_{xij} &= I\otimes \proj{i}\otimes\proj{j} .
\end{align*}

That is, the $x$ has a special meaning and just stands for the place where the identity
acts. Define $P_{ixx}$ etc analogously. Note that e.g. $P_{ixx}P_{xjx}=P_{ijx}$. Since
$Z_1=P_{0xx}-P_{1xx}$, $Z_2=P_{x0x}-P_{x1x}$, $Z_3=P_{xx0}-P_{xx1}$ we have the following
spectral decomposition of the observables we are interested in:

\begin{align*}
  Z_1Z_2 &= P_{00x} + P_{11x} - P_{01x} - P_{10x} , \\
  Z_2Z_3 &= P_{x00} + P_{x11} - P_{x01} - P_{x10} .
\end{align*}

Let $P_j$ for $j=0..3$ be the projectors from (10.5) to (10.8). If we measure for example
$+1$ for $Z_1Z_2$ and $+1$ for $Z_2Z_3$ this corresponds to the projection (note: the
order of the projections is not important due to commutativity)

$$
  (+1, +1):\; (P_{00x} + P_{11x})(P_{x00} + P_{x11}) = P_{000} + P_{111} = P_0 .
$$

In the same way the other three measurements can be mapped to the $P_j$ too:

\begin{align*}
  &(+1, -1):\; (P_{00x} + P_{11x})(P_{x01} + P_{x10}) = P_{001} + P_{110} = P_3 , \\
  &(-1, +1):\; (P_{01x} + P_{10x})(P_{x00} + P_{x11}) = P_{100} + P_{011} = P_1 , \\
  &(-1, -1):\; (P_{01x} + P_{10x})(P_{x01} + P_{x10}) = P_{101} + P_{010} = P_2 .
\end{align*}

Hence the projectors are the same, just re-labeled. QED.

** Exercise 10.4
Consider the three qubit bit flip code. Suppose we had performed the error syndrome
measurement by measuring the eight orthogonal projectors corresponding to projections onto
the eight computational basis states.

1. Write out the projectors corresponding to this measurement, and explain how the
   measurement result can be used to diagnose the error syndrome: either no bits flipped or
   bit number $j$ flipped, where $j$ is in the range one to three.
2. Show that the recovery procedure works only for computational basis states.
3. What is the minimum fidelity for the error-correction procedure?

