chapter_10.html

<div id="outline-container-orgf7f1586" class="outline-4">
<h4 id="orgf7f1586">Solution for part 1</h4>
<div class="outline-text-4" id="text-orgf7f1586">
<p>
The projectors are just \(P_j=\proj{j}\) for \(j=0..7\) (note that the binary representations
for the numbers from \(0\) to \(7\) are \(000\), \(001\), \(010\), \(011\), \(100\), \(101\), \(110\),
\(111\)). A corresponding observable distinguishing each projector would be
\(A=\sum_jj\proj{j}\).
</p>

<p>
Recall that the encoded state is \(\ket{\psi}=a\ket{000}+b\ket{111}\). Let \(k=0\), \(k=1\),
\(k=2\), \(k=3\) denote <i>no error</i>, <i>error in qubit 1, 2, 3</i>, respectively. Let \(M_k\) be the
set of possible measurements for the given value of \(k\). We have
</p>

<p>
<a id="org45b9bf6"></a>
</p>
\begin{align*}
  M_0 &= \{0, 7\} , \\
  M_1 &= \{1, 6\} , \\
  M_2 &= \{2, 5\} , \\
  M_3 &= \{4, 3\} .
\end{align*}

<p>
Moreover, measuring \(0,1,2,4\) happens with probability \(\abs{a}^2\) and measuring \(7,6,5,3\)
happens with probability \(\abs{b}^2\) (conditioned on a fixed value for \(j\)). Since the
four sets are disjoint we can infer the error (the value of \(k\)) from the measurement
(e.g. measuring \(1\) or \(6\) implies that the error was \(k=1\) (with certainty if only one of
the three errors "is allowed" to happen)).
</p>
</div>
</div>

<div id="outline-container-org19a4f1d" class="outline-4">
<h4 id="org19a4f1d">Solution for part 2</h4>
<div class="outline-text-4" id="text-org19a4f1d">
<p>
If we measure \(j\) and infer the error \(k\) <a href="#org45b9bf6">according to the sets</a> \(M_k\) we would correct it
by applying \(X_k\) to the state. In other words, the following quantum operation \(\calR\)
performs the syndrome measurement followed by the recovery:
</p>

\begin{align*}
  E_0 &= P_0, \\ E_1 &= X_1P_1, \\ E_2 &= X_2P_2, \\ E_3 &= X_3P_3, \\
  E_4 &= X_3P_4, \\ E_5 &= X_2P_5, \\ E_6 &= X_1P_6, \\ E_7 &= P_7 .
\end{align*}

<p>
Note that \(\calR\) is indeed trace-preserving (\(\sum_jE_j^\dagger\?E_j)=I\)). Recall
\(\ket{\psi}=a\ket{000}+b\ket{111}\). Then (the <i>no error</i> case)
</p>

<p>
\[
  \calR(\ket{\psi}) = \abs{a}^2 \proj{000} + \abs{b}^2 \proj{111} .
\]
</p>

<p>
The same formula holds for \(\ket{\psi}\) replaced by \(X_k\ket{\psi}\) (\(k=1..3\)). Hence, for
the following noise channel
</p>

<p>
\[
  \calE(\rho) = (1-p)\rho + \sum_{k=1}^3 p_k X_k \rho X_k
\]
</p>

<p>
where \(\sum_kp_k=p\) (this implies trace-preservation, but we could more generally assume
\(\ldots\leq\?p\), meaning that with certain probability "something else" happens), which
stands for having at most one bit-flip (with probability \(p_k\) at position \(k\)), we have
</p>

<p>
\[
  \calR\circ\calE(\ket{\psi}) = \abs{a}^2 \proj{000} + \abs{b}^2 \proj{111} .
\]
</p>

<p>
(If \(\calE\) was not trace-preserving the RHS would have a factor \(1-p+\sum_jp_j\).) Hence
the bit-flip error gets indeed corrected, but unwanted side effects happen too. The final
state after recovery is either \(\ket{000}\) (probability \(\abs{a}^2\)) or \(\ket{111}\)
(probability \(\abs{b}^2\)). That is the state collapses to a basis state. This is only
correct if \(\ket{\psi}\) was already in a basis state (\(a=0\) or \(b=0\)) - which is the claim
of part 2.
</p>
</div>
</div>

<div id="outline-container-org890933c" class="outline-4">
<h4 id="org890933c">Solution for part 3</h4>
<div class="outline-text-4" id="text-org890933c">
<p>
Let us consider two cases:
</p>

<ol class="org-ol">
<li>We do not get to know the results of the syndrome measurement.</li>
<li>We get to know the results of the syndrome measurement.</li>
</ol>

<p>
In case 1 the whole error correction procedure is given by \(\calR\) from the solution of
part 2. Let \(\rho=\calR\circ\calE(\ket{\psi})\). Then
</p>

<p>
\[
  F(\ket{\psi},\rho) = \sqrt{\bra{\psi}\rho\ket{\psi}} = \sqrt{\abs{a}^4 + \abs{b}^4} .
\]
</p>

<p>
Since \(\abs{a}^2+\abs{b}^2=1\) the minimum occurs at \(\abs{a}^2=\abs{b}^2=1/2\). Hence
\(F\geq1/\sqrt{2}\) in that case.
</p>

<p>
In case 2 the post-correction state \(\rho\) is either \(\ket{000}\) (probability \(\abs{a}^2\))
or \(\ket{111}\) (probability \(\abs{b}^2\)). Hence
</p>

<p>
\[
  F(\ket{\psi},\rho) \in \left\{\sqrt{\braket{\psi}{i_L}\braket{i_L}{\psi}} \; \middle| \; i\in\{0,1\}\right\}
  = \{\abs{a}, \abs{b}\} ,
\]
</p>

<p>
where the first alternative occurs with probability \(\abs{a}^2\) and the second one with
\(\abs{b}^2\).
</p>

<p>
In both cases the minimial fidelity does not depend on the specifics of the noise model
and in particular is always bad if \(\abs{a}\) and \(\abs{b}\) are bounded away from \(0\) (or
equivalently, from \(1\)).
</p>

<dl class="org-dl">
<dt>Remark</dt><dd><p>
The minimum fidelity of case 1 is the weighted root square mean of the two
possible fidelities of case 2. The weights are \(\abs{a}^2\) and \(\abs{b}^2\). See e.g.
<a href="https://en.wikipedia.org/wiki/Generalized_mean">generalized mean</a> on wikipedia for more infos. To make this more apparent consider
\(\sigma=p\proj{0}+(1-p)\proj{1}\) (and \(\ket{\psi}=a\ket{0}+b\ket{1}\)):
</p>

<p>
\[
  F(\ket{\psi},\sigma) = \sqrt{\bra{\psi}\sigma\ket{\psi}} = \sqrt{p\abs{a}^2+(1-p)\abs{b}^2} .
  \]
</p>

<p>
Here \(p\) and \(1-p\) are the weights.
</p></dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-org40858de" class="outline-3">
<h3 id="org40858de">Exercise 10.5</h3>
<div class="outline-text-3" id="text-org40858de">
<p>
Show that the syndrome measurement for detecting phase flip errors in the Shor code
corresponds to measuring the observables \(A=X_1X_2X_3X_4X_5X_6\) and
\(B=X_4X_5X_6X_7X_8X_9\).
</p>
</div>

<div id="outline-container-exercise-10.5-solution" class="outline-4">
<h4 id="exercise-10.5-solution">Proof</h4>
<div class="outline-text-4" id="text-exercise-10.5-solution">
<p>
Let us denote
</p>

\begin{align*}
  \ket{\pi} &= \frac{1}{\sqrt{2}} (\ket{000} + \ket{111}) , \\
  \ket{\mu} &= \frac{1}{\sqrt{2}} (\ket{000} - \ket{111}) .
\end{align*}

<p>
With this notation the Shor code is given by
</p>

\begin{align*}
  \ket{0_L} &= \ket{\pi\pi\pi} , \\
  \ket{1_L} &= \ket{\mu\mu\mu} , \\
\end{align*}

<p>
Hence we have the following encoding:
</p>

<p>
\[
  \ket{\psi} = \ket{\psi_0} = a\ket{0_L} + b\ket{1_L} = a\ket{\pi\pi\pi} + b\ket{\mu\mu\mu} .
\]
</p>

<p>
In this notation a phase flip error is represented naturally. For example a phase flip in
one of the three qubits in the first block of \(\ket{\psi}\) is given by
</p>

<p>
\[
  \ket{\psi_1} = a\ket{\mu\pi\pi} + b\ket{\pi\mu\mu} .
\]
</p>

<p>
It doesn't matter in which of the three qubits, it always leads to the same state. The
other two errors (phase flip in the second or third block) are given by
</p>

\begin{align*}
  \ket{\psi_2} &= a\ket{\pi\mu\pi} + b\ket{\mu\pi\mu} , \\
  \ket{\psi_3} &= a\ket{\pi\pi\mu} + b\ket{\mu\mu\pi} .
\end{align*}

<p>
Now observe that
</p>

\begin{align*}
  X_1X_2X_3 \ket{\pi} &= + \ket{\pi} , \\
  X_1X_2X_3 \ket{\mu} &= - \ket{\mu} .
\end{align*}

<p>
Hence e.g. measuring a state \(\ket{ijk}\) (\(i,j,k\in\{\pi,\mu\}\)) with respect to \(A\)
detects if \(i=j\) (measurement result: \(+1\)) or \(i\neq\?j\) (measurement result:
\(+1\)). Because of their special structure this translates to \(\ket{\psi_k}\). For the four
errors (first one is <i>no error</i>) we get the following measurement results (each with
certainty):
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">\(k\) (\(\ket{\psi_k}\))</th>
<th scope="col" class="org-right">\(A\)</th>
<th scope="col" class="org-right">\(B\)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">+1</td>
<td class="org-right">+1</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">-1</td>
<td class="org-right">+1</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">-1</td>
<td class="org-right">-1</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">+1</td>
<td class="org-right">-1</td>
</tr>
</tbody>
</table>

<p>
Hence we can infer the syndrome \(k\) (which error occured) from the measurement - as
desired. QED.
</p>
</div>
</div>
</div>

<div id="outline-container-org115331f" class="outline-3">
<h3 id="org115331f">Exercise 10.6</h3>
<div class="outline-text-3" id="text-org115331f">
<p>
Show that recovery from a phase flip on any of the first three qubits may be accomplished
by applying the operator \(Z_1Z_2Z_3\).
</p>
</div>
