src/chapter_10.org
*** Proof
Let us reuse the notation from the [[#exercise-10.5-solution][solution]] of exercise 10.5. Clearly

$$
  Z_1Z_2Z_3 \ket{\pi} = \ket{\mu} \text{ and } Z_1Z_2Z_3 \ket{\mu} = \ket{\pi} .
$$

An error in the first three qubits means that the corresponding state is
$\ket{\psi_1}$. By the above we have:

$$
  Z_1Z_2Z_3 \ket{\psi_1} = \ket{\psi} .
$$

QED.

** Exercise 10.7
Consider the three qubit bit flip code of Section 10.1.1, with corresponding projector
$P=\proj{000}+\proj{111}$. The noise process this code against has operation elements

$$
  \left\{ \sqrt{(1-p)^3}I, \sqrt{p(1-p)^2}X_1, \sqrt{p(1-p)^2}X_2, \sqrt{p(1-p)^2}X_3 \right\} ,
$$

where $p$ is the probability that a bit flips. Note that this quantum operation $\calE$ is
not trace-preserving, since we have omitted operation elements corresponding to bit flips
on two and three qubits. Verify the quantum error-correction conditions for this code and
noise process.

*** Solution
Clearly $PX_iX_jP=\delta_{ij}P$. Hence

\begin{align*}
  P E_0^\dagger E_0 P &= (1-p)^3 P , \\
  P E_i^\dagger E_i P &= p(1-p)^2 P \text{ for } i=1..3 , \\
  P E_i^\dagger E_j P &= 0 \text{ for } i\neq j .
\end{align*}

Hence the conditions are satisfied and there exists an error correction procedure $\calR$
for this noise.

*** Bonus: Calculating the recovery procedure
By the previous calculation and Theorem 10.1 there exists a trace-preserving quantum
operation $\calR$ such that

$$
  \calR \circ \calE (P\rho P) = [(1-p)^3 + 3p(1-p)^2] \, P \rho P .
$$

The concrete form of the proportionality factor follows from (10.25) as it equals
$\sum_kd_{kk}$. Since this is a trace this formula would even be true if $(d_{ij})$ wasn't
already diagonal.

To compute the Kraus matrices $R_k$ of $\calR$ we need the $E_k$ such that the $(d_{ij})$
are diagonal. This is already the case

$$
  d = \diag((1-p)^3, p(1-p)^2, p(1-p)^2, p(1-p)^2) .
$$

From the proof of Theorem 10.1 we know that

$$
  R_k = U_k^\dagger P_k
$$

where $P_k=U_kPU_k^\dagger$ and $E_kP=\sqrt{d_{kk}}U_kP$ is a polar decomposition. The
$P_k$ are the projectors onto $E_kC$ ($C$ being the code space onto which $P$
projects). The diagonality of $(d_{ij})$ implies that $P_iP_j=\delta_{ij}P_i$ (meaning
that the error subspaces are orthogonal to each other).

Clearly we can set $U_0=I$ (it is only uniquely defined on the image of $P$). For $k=1$ we
have

$$
  E_1 P = \sqrt{p(1-p)^2} X_1 P .
$$

This is already a polar decomposition (the Pauli operators are unitary). Hence we can just
set $U_1=X_1$ and analogously $U_k=X_k$ for $k=1..3$. Hence

\begin{align*}
  P_0 &= \proj{000} + \proj{111} , \\
  P_1 &= \proj{100} + \proj{011} , \\
  P_2 &= \proj{010} + \proj{101} , \\
  P_3 &= \proj{001} + \proj{110} .
\end{align*}

Note that this corresponds to the already in (10.5-10.8) introduced syndrome measurement
operators. The Kraus matrices of $\calR$ are

$$
  R_k = U_k^\dagger P_k = \begin{cases} IP = P & \text{for } k = 0 , \\
    X_k X_kPX_k = PX_k & \text{for } k \in \{1,2,3\} . \end{cases}
$$

** Exercise 10.8
Verify that the three qubit phase flip code $\ket{0_L}=\ket{+++}$, $\ket{1_L}=\ket{---}$
satisfies the quantum error-correction conditions for the set of error operators
$\{I,Z_1,Z_2,Z_3\}$.

*** Solution 1
Let us reduce this to the bit flip code. To convert to the bit flip code we only have to
conjugate the projector of the code and the Kraus operators of the errors by
$H^{\otimes3}$ (Hadamard).

$$
  \proj{000} + \proj{111} = H^{\otimes3} \proj{+++} + \proj{---} H^{\otimes3}
$$

and

$$
  X_k = H^{\otimes3} Z_k H^{\otimes3} .
$$

Let $P$ be the projector of the phase flip code and let $E_i$ be the mentioned errors it
corrects. Let $Q$ and $F_j$ be the same thing for the bit flip.

$$
  P E_i^\dagger E_j P = H^{\otimes3} Q F_i^\dagger F_j Q H^{\otimes3}
  = H^{\otimes3} \delta_{ij} Q H^{\otimes3}
  = \delta_{ij} P .
$$

In the second equality we used what we already know about the bit flip code.

*** Solution 2
We can also verify this explicitly. Let $P=P_{+++}+P_{---}$ be the projector onto the
code, where we use the notation $P_{ijk}=\proj{ijk}$. Clearly
$PE_i^\dagger\?E_iP=PIP=P$. Moreover

$$
  PZ_1P = (P_{+++} + P_{---})(P_{-++} + P_{+--}) = 0
$$

and

$$
  PZ_1Z_2P = (P_{+++} + P_{---})(P_{--+} + P_{++-}) = 0 .
$$

Similarly $PIZ_jP=PZ_iZ_jP=0$ for $i\neq\?j$. Hence $PE_i^\dagger\?E_iP=\delta_{ij}$.

** Exercise 10.9
Again, consider the three qubit phase flip code. Let $P_i$ and $Q_i$ be the projectors
onto the $\ket{0}$ and $\ket{1}$ states, respectively, of the $i$​th qubit. Prove that the
three qubit phase flip code protects against the error set ${I,P_1,Q_1,P_2,Q_2,P_3,Q_3}$.

*** Solution
Recall that the phase flip code corrects the errors $I$, $Z_1$, $Z_2$, and $Z_3$. By
theorem 10.2 linear combinations of these errors are corrected too. Note that we have

\begin{align*}
  P_k &= \frac{1}{2} (I + Z_k) , \\
  Q_k &= \frac{1}{2} (I - Z_k) .
\end{align*}

Hence those errors are corrected too.

** Exercise 10.10
Explicitly verify the quantum error-correction conditions for the Shor code, for the error
set containing $I$ and the error operators $X_j,Y_j,Z_j$ for $j=1$ through $9$.

*** Solution
Let us denote

\begin{align*}
  \ket{\pi} &= \frac{1}{\sqrt{2}} (\ket{000} + \ket{111}) , \\
  \ket{\mu} &= \frac{1}{\sqrt{2}} (\ket{000} - \ket{111}) .
\end{align*}

The Shor code is given by he projector

$$
  P = \proj{\pi\pi\pi} + \proj{\mu\mu\mu} .
$$

It is not hard to see that the errors transform the code space into a set of mutually
orthogonal subspaces - with one exception. The effect of $Z_j$ is the same if $j$ stays
within one "block" (there are three block $\{1,2,3\}$, $\{4,5,6\}$, and
$\{7,8,9\}$). Hence:

$$
  PE_i^\dagger E_j P = \begin{cases}
    1 & \text{if } i=j \text{ or } E_i,E_j \text{ both Z on same block} , \\
    0 & \text{else} .
  \end{cases}
$$

** Exercise 10.11
Construct operation elements for a single qubit quantum operation $\calE$ that upon input
of any state $\rho$ replaces it with the completely randomized state $I/2$. It is amazing
that even such noise models as this may be corrected by codes such as the Shor code!

*** Solution
We already know that the quantum operation

$$
  \calE(\rho) = \frac{1}{2} I
$$

is the depolarizing channel with $p=1$. By (8.102) this is equal to

$$
  \calE(\rho) = \frac{1}{4} (I\rho I + X\rho X + Y\rho Y + Z\rho Z) .
$$

Hence the relevant operation elements are

$$
  \left\{\frac{1}{2}I, \frac{1}{2}X, \frac{1}{2}Y, \frac{1}{2}Z \right\} .
$$

