chapter_10.html

<div id="outline-container-orgcc31cc4" class="outline-4">
<h4 id="orgcc31cc4">Proof</h4>
<div class="outline-text-4" id="text-orgcc31cc4">
<p>
Let us reuse the notation from the <a href="#exercise-10.5-solution">solution</a> of exercise 10.5. Clearly
</p>

<p>
\[
  Z_1Z_2Z_3 \ket{\pi} = \ket{\mu} \text{ and } Z_1Z_2Z_3 \ket{\mu} = \ket{\pi} .
\]
</p>

<p>
An error in the first three qubits means that the corresponding state is
\(\ket{\psi_1}\). By the above we have:
</p>

<p>
\[
  Z_1Z_2Z_3 \ket{\psi_1} = \ket{\psi} .
\]
</p>

<p>
QED.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd07d7e7" class="outline-3">
<h3 id="orgd07d7e7">Exercise 10.7</h3>
<div class="outline-text-3" id="text-orgd07d7e7">
<p>
Consider the three qubit bit flip code of Section 10.1.1, with corresponding projector
\(P=\proj{000}+\proj{111}\). The noise process this code against has operation elements
</p>

<p>
\[
  \left\{ \sqrt{(1-p)^3}I, \sqrt{p(1-p)^2}X_1, \sqrt{p(1-p)^2}X_2, \sqrt{p(1-p)^2}X_3 \right\} ,
\]
</p>

<p>
where \(p\) is the probability that a bit flips. Note that this quantum operation \(\calE\) is
not trace-preserving, since we have omitted operation elements corresponding to bit flips
on two and three qubits. Verify the quantum error-correction conditions for this code and
noise process.
</p>
</div>

<div id="outline-container-orgc4513ee" class="outline-4">
<h4 id="orgc4513ee">Solution</h4>
<div class="outline-text-4" id="text-orgc4513ee">
<p>
Clearly \(PX_iX_jP=\delta_{ij}P\). Hence
</p>

\begin{align*}
  P E_0^\dagger E_0 P &= (1-p)^3 P , \\
  P E_i^\dagger E_i P &= p(1-p)^2 P \text{ for } i=1..3 , \\
  P E_i^\dagger E_j P &= 0 \text{ for } i\neq j .
\end{align*}

<p>
Hence the conditions are satisfied and there exists an error correction procedure \(\calR\)
for this noise.
</p>
</div>
</div>

<div id="outline-container-orgdb376ce" class="outline-4">
<h4 id="orgdb376ce">Bonus: Calculating the recovery procedure</h4>
<div class="outline-text-4" id="text-orgdb376ce">
<p>
By the previous calculation and Theorem 10.1 there exists a trace-preserving quantum
operation \(\calR\) such that
</p>

<p>
\[
  \calR \circ \calE (P\rho P) = [(1-p)^3 + 3p(1-p)^2] \, P \rho P .
\]
</p>

<p>
The concrete form of the proportionality factor follows from (10.25) as it equals
\(\sum_kd_{kk}\). Since this is a trace this formula would even be true if \((d_{ij})\) wasn't
already diagonal.
</p>

<p>
To compute the Kraus matrices \(R_k\) of \(\calR\) we need the \(E_k\) such that the \((d_{ij})\)
are diagonal. This is already the case
</p>

<p>
\[
  d = \diag((1-p)^3, p(1-p)^2, p(1-p)^2, p(1-p)^2) .
\]
</p>

<p>
From the proof of Theorem 10.1 we know that
</p>

<p>
\[
  R_k = U_k^\dagger P_k
\]
</p>

<p>
where \(P_k=U_kPU_k^\dagger\) and \(E_kP=\sqrt{d_{kk}}U_kP\) is a polar decomposition. The
\(P_k\) are the projectors onto \(E_kC\) (\(C\) being the code space onto which \(P\)
projects). The diagonality of \((d_{ij})\) implies that \(P_iP_j=\delta_{ij}P_i\) (meaning
that the error subspaces are orthogonal to each other).
</p>

<p>
Clearly we can set \(U_0=I\) (it is only uniquely defined on the image of \(P\)). For \(k=1\) we
have
</p>

<p>
\[
  E_1 P = \sqrt{p(1-p)^2} X_1 P .
\]
</p>

<p>
This is already a polar decomposition (the Pauli operators are unitary). Hence we can just
set \(U_1=X_1\) and analogously \(U_k=X_k\) for \(k=1..3\). Hence
</p>

\begin{align*}
  P_0 &= \proj{000} + \proj{111} , \\
  P_1 &= \proj{100} + \proj{011} , \\
  P_2 &= \proj{010} + \proj{101} , \\
  P_3 &= \proj{001} + \proj{110} .
\end{align*}

<p>
Note that this corresponds to the already in (10.5-10.8) introduced syndrome measurement
operators. The Kraus matrices of \(\calR\) are
</p>

<p>
\[
  R_k = U_k^\dagger P_k = \begin{cases} IP = P & \text{for } k = 0 , \\
    X_k X_kPX_k = PX_k & \text{for } k \in \{1,2,3\} . \end{cases}
\]
</p>
</div>
</div>
</div>

<div id="outline-container-org9282486" class="outline-3">
<h3 id="org9282486">Exercise 10.8</h3>
<div class="outline-text-3" id="text-org9282486">
<p>
Verify that the three qubit phase flip code \(\ket{0_L}=\ket{+++}\), \(\ket{1_L}=\ket{---}\)
satisfies the quantum error-correction conditions for the set of error operators
\(\{I,Z_1,Z_2,Z_3\}\).
</p>
</div>

<div id="outline-container-orgd51ba25" class="outline-4">
<h4 id="orgd51ba25">Solution 1</h4>
<div class="outline-text-4" id="text-orgd51ba25">
<p>
Let us reduce this to the bit flip code. To convert to the bit flip code we only have to
conjugate the projector of the code and the Kraus operators of the errors by
\(H^{\otimes3}\) (Hadamard).
</p>

<p>
\[
  \proj{000} + \proj{111} = H^{\otimes3} \proj{+++} + \proj{---} H^{\otimes3}
\]
</p>

<p>
and
</p>

<p>
\[
  X_k = H^{\otimes3} Z_k H^{\otimes3} .
\]
</p>

<p>
Let \(P\) be the projector of the phase flip code and let \(E_i\) be the mentioned errors it
corrects. Let \(Q\) and \(F_j\) be the same thing for the bit flip.
</p>

<p>
\[
  P E_i^\dagger E_j P = H^{\otimes3} Q F_i^\dagger F_j Q H^{\otimes3}
  = H^{\otimes3} \delta_{ij} Q H^{\otimes3}
  = \delta_{ij} P .
\]
</p>

<p>
In the second equality we used what we already know about the bit flip code.
</p>
</div>
</div>

<div id="outline-container-org2051b9e" class="outline-4">
<h4 id="org2051b9e">Solution 2</h4>
<div class="outline-text-4" id="text-org2051b9e">
<p>
We can also verify this explicitly. Let \(P=P_{+++}+P_{---}\) be the projector onto the
code, where we use the notation \(P_{ijk}=\proj{ijk}\). Clearly
\(PE_i^\dagger\?E_iP=PIP=P\). Moreover
</p>

<p>
\[
  PZ_1P = (P_{+++} + P_{---})(P_{-++} + P_{+--}) = 0
\]
</p>

<p>
and
</p>

<p>
\[
  PZ_1Z_2P = (P_{+++} + P_{---})(P_{--+} + P_{++-}) = 0 .
\]
</p>

<p>
Similarly \(PIZ_jP=PZ_iZ_jP=0\) for \(i\neq\?j\). Hence \(PE_i^\dagger\?E_iP=\delta_{ij}\).
</p>
</div>
</div>
</div>

<div id="outline-container-orgd01030e" class="outline-3">
<h3 id="orgd01030e">Exercise 10.9</h3>
<div class="outline-text-3" id="text-orgd01030e">
<p>
Again, consider the three qubit phase flip code. Let \(P_i\) and \(Q_i\) be the projectors
onto the \(\ket{0}\) and \(\ket{1}\) states, respectively, of the \(i\)​th qubit. Prove that the
three qubit phase flip code protects against the error set \({I,P_1,Q_1,P_2,Q_2,P_3,Q_3}\).
</p>
</div>

<div id="outline-container-org74db796" class="outline-4">
<h4 id="org74db796">Solution</h4>
<div class="outline-text-4" id="text-org74db796">
<p>
Recall that the phase flip code corrects the errors \(I\), \(Z_1\), \(Z_2\), and \(Z_3\). By
theorem 10.2 linear combinations of these errors are corrected too. Note that we have
</p>

\begin{align*}
  P_k &= \frac{1}{2} (I + Z_k) , \\
  Q_k &= \frac{1}{2} (I - Z_k) .
\end{align*}

<p>
Hence those errors are corrected too.
</p>
</div>
</div>
</div>

<div id="outline-container-org8e8a14e" class="outline-3">
<h3 id="org8e8a14e">Exercise 10.10</h3>
<div class="outline-text-3" id="text-org8e8a14e">
<p>
Explicitly verify the quantum error-correction conditions for the Shor code, for the error
set containing \(I\) and the error operators \(X_j,Y_j,Z_j\) for \(j=1\) through \(9\).
</p>
</div>

<div id="outline-container-orgaeaeca5" class="outline-4">
<h4 id="orgaeaeca5">Solution</h4>
<div class="outline-text-4" id="text-orgaeaeca5">
<p>
Let us denote
</p>

\begin{align*}
  \ket{\pi} &= \frac{1}{\sqrt{2}} (\ket{000} + \ket{111}) , \\
  \ket{\mu} &= \frac{1}{\sqrt{2}} (\ket{000} - \ket{111}) .
\end{align*}

<p>
The Shor code is given by he projector
</p>

<p>
\[
  P = \proj{\pi\pi\pi} + \proj{\mu\mu\mu} .
\]
</p>

<p>
It is not hard to see that the errors transform the code space into a set of mutually
orthogonal subspaces - with one exception. The effect of \(Z_j\) is the same if \(j\) stays
within one "block" (there are three block \(\{1,2,3\}\), \(\{4,5,6\}\), and
\(\{7,8,9\}\)). Hence:
</p>

<p>
\[
  PE_i^\dagger E_j P = \begin{cases}
    1 & \text{if } i=j \text{ or } E_i,E_j \text{ both Z on same block} , \\
    0 & \text{else} .
  \end{cases}
\]
</p>
</div>
</div>
</div>

<div id="outline-container-org14d26e6" class="outline-3">
<h3 id="org14d26e6">Exercise 10.11</h3>
<div class="outline-text-3" id="text-org14d26e6">
<p>
Construct operation elements for a single qubit quantum operation \(\calE\) that upon input
of any state \(\rho\) replaces it with the completely randomized state \(I/2\). It is amazing
that even such noise models as this may be corrected by codes such as the Shor code!
</p>
</div>

<div id="outline-container-orgc131a80" class="outline-4">
<h4 id="orgc131a80">Solution</h4>
<div class="outline-text-4" id="text-orgc131a80">
<p>
We already know that the quantum operation
</p>

<p>
\[
  \calE(\rho) = \frac{1}{2} I
\]
</p>

<p>
is the depolarizing channel with \(p=1\). By (8.102) this is equal to
</p>

<p>
\[
  \calE(\rho) = \frac{1}{4} (I\rho I + X\rho X + Y\rho Y + Z\rho Z) .
\]
</p>

<p>
Hence the relevant operation elements are
</p>

<p>
\[
  \left\{\frac{1}{2}I, \frac{1}{2}X, \frac{1}{2}Y, \frac{1}{2}Z \right\} .
\]
</p>
</div>
</div>
</div>
