src/chapter_10.org
** Exercise 10.12
Show that the fidelity between the state $\ket{0}$ and $\calE(\proj{0})$ is $\sqrt{1-2p/3}$
and use this to argue that the minimum fidelity for the depolarizing channel is
$\sqrt{1-2p/3}$.

*** Solution 1
Let us follow the hint of the book.

$$
  F(\ket{0}, \calE(\proj{0}))
  = \sqrt{(1-p) + \frac{p}{3}(\bra{0}X\ket{0}^2 + \bra{0}Y\ket{0}^2 + \bra{0}Z\ket{0}^2)}
  = \sqrt{(1-p) + \frac{p}{3}}
  = \sqrt{1-\frac{2p}{3}} .
$$

Let $\ket{\psi}$ be an arbitrary state and $U$ be a unitary operator such that
$\ket{\psi}=U\ket{0}$. Then

$$
  F(\ket{\psi}, \calE(\proj{\psi})) = F(U\ket{0}, U\calE(\proj{0})U^\dagger)
  = F(\ket{0}, \calE(\proj{0})) = \sqrt{1-\frac{2p}{3}} .
$$

In the second equality we used that the fidelity is invariant under unitary transformations.

*** Solution 2
We could also prove the claim by using an alternative formula for the depolarizing channel:

$$
  \calE(\rho) = \frac{2p}{3} I + \left(1 - \frac{4p}{3}\right) \rho .
$$

(compare equations (8.100) and (8.102).) Hence

$$
  F(\ket{\psi}, \calE(\proj{\psi})) = \sqrt{\frac{2p}{3} + \left(1 - \frac{4p}{3}\right)}
  = \sqrt{1-\frac{2p}{3}} .
$$

*** Solution 3
Yet another approach first calculates

$$
  F(\ket{\psi}, \calE(\proj{\psi}))
  = \sqrt{(1-p) + \frac{p}{3}(\bra{\psi}X\ket{\psi}^2 + \bra{\psi}Y\ket{\psi}^2 + \bra{\psi}Z\ket{\psi}^2)} .
$$

Recall the representation $\proj{\psi}=2\inv(I+\vec{r}\cdot\vec{\sigma})$ of a qubit in
the bloch sphere ($\abs{\vec{r}}=1$). One can show that

$$
  \bra{\psi}Z\ket{\psi} = r_z
$$

and analogous formulas for $r_x$ and $r_y$. Hence

$$
  F(\ket{\psi}, \calE(\proj{\psi})) = \sqrt{(1-p) + \frac{p}{3}\abs{\vec{r}}^2} = \sqrt{1-\frac{2p}{3}} .
$$

- Remark :: To see e.g.

  $$
  \bra{\psi}Z\ket{\psi} = r_z
  $$

  observe that

  $$
  \bra{\psi}Z\ket{\psi} = \trace{\proj{\psi}Z} = r_z .
  $$

  In the last equality we used that the Pauli matrices (including $I$) are an orthogonal
  set with respect to the Hilbert-Schmidt scalar product (with norm $\sqrt{2}$ for each
  base vector). The other two formulas for $r_x$ and $r_y$ follow along the same lines.

  If you want to see the last equality directly, observe that (using $S=\sqrt{Z}$)

  $$
  \trace{\proj{\psi}Z} = \trace{S\proj{\psi}S}
  $$

  and use $SIS=Z$, $SXS=\ii\?X$, $SYS=\ii\?Y$, $SZS=I$ (only the last term has a non-zero
  trace).

** Exercise 10.13
Show that the minimum fidelity $F(\ket{\psi},\calE(\proj{\psi}))$ when $\calE$ is the
amplitude damping channel with parameter $\gamma$, is $\sqrt{1-\gamma}$.

*** Proof
Let us use sage to get an algebraic expression for $F$. First define amplitude damping

#+begin_src sage
  E0 = matrix.diagonal([1, sqrt(1-g)])
  E1 = matrix([[0, sqrt(g)], [0, 0]])
  AD = make_operation([E0, E1])
#+end_src

Now we can use this to compute $F$:

#+begin_src sage :tangle no :results replace :cache yes
  psi = a*ket('0') + b*ket('1')
  psi_mat = matrix(psi).T
  rho = AD(psi_mat*psi_mat.H).simplify_full()
  (psi.conjugate() * rho * psi).simplify_full()
#+end_src

#+RESULTS[a966bcbc6402d10431f26efd81c21e2bb71234f7]:
: 2*a*b*sqrt(-g + 1)*conjugate(a)*conjugate(b) + a^2*conjugate(a)^2 + b^2*conjugate(b)^2 + (a*b*conjugate(a)*conjugate(b) - b^2*conjugate(b)^2)*g

This looks a bit ugly so let us rewrite this:

$$
  F = \abs{a}^4 + \abs{b}^4 + \gamma(\abs{a}^2 \abs{b}^2 - \abs{b}^4) + 2\sqrt{1-\gamma}\, \abs{a}^2\abs{b}^2 .
$$

Substituting $x=\abs{a}^2$ and $y=\abs{b}^2$ this can be written as:

$$
  F = \sqrt{f(x,y)} = \sqrt{x^2 + y^2 + \gamma (xy - y^2) + 2\sqrt{1-\gamma} \, xy} ,
$$

under the constraint $x+y=1$ and $x,y\geq0$. Thus we have to solve a constrained
minimization problem. There are two possibilities. The first one is that the minimum
occurs at the boundaries of the feasible region. Therefore let us calculate

\begin{align*}
  f(1,0) &= 1 , \\
  f(0,1) &= 1 - \gamma .
\end{align*}

The second possibility is that the minimum occurs in the inside of the feasible region. In
that case we might try to find it by the method of Lagrange multipliers:

\begin{align*}
  \partial_x f(x, y) &= 2x + (\gamma + 2\sqrt{1-\gamma}) y = \lambda \cdot 1 , \\
  \partial_y f(x, y) &= 2(1-\gamma)y + (\gamma + 2\sqrt{1-\gamma}) x = \lambda \cdot 1 .
\end{align*}

This looks a bit complicated so let us change the strategy a bit by defining a
parameterization of the feasible region

$$
  g(s) = f(s,1-s) .
$$

Abbreviating $\alpha=\gamma+2\sqrt{1-\gamma}$ we see that

\begin{align*}
  g'(s) &= \partial_x f(s,1-s) - \partial_y f(s,1-s) \\
  &= (\alpha + 2\gamma - 2) - 2(\gamma + \alpha - 2) s \\
  &=: c_0 - c_1 s .
\end{align*}

Observe that $\alpha+\gamma\geq2$. Hence $c_0,c_1\geq0$ which implies that there is a
$s_0\geq0$ such that $g$ is increasing for $s\leq\?s_0$ and decreasing afterwards (note
also that $s_0$ could be larger than $1$). Hence a local extremum can only be a local
maximum and the minimum is indeed obtained at the boundary:

$$
  f(0, 1) = g(0) = 1 - \gamma .
$$

Hence $F_{\min}=\sqrt{1-\gamma}$ . QED.

** Exercise 10.14
Write an expression for a generator matrix encoding $k$ bits using $r$ repetitions for
each bit. This is an $[rk,k]$ linear code, and should have an $rk\times\?k$ generator
matrix.

*** Solution
:PROPERTIES:
:CUSTOM_ID: exercise-10.14-solution
:END:
Let $\mathbb{1}_r\in\?\BB^r$ be the vector containing just ones. A generator for this code
is given by the tensor product

$$
  G = I_k \otimes \mathbb{1}_r .
$$

This naturally reproduces the special cases $r=3$, $k\in\{1,2\}$ from the book.

** Exercise 10.15
Show that adding one column of $G$ to another results in a generator matrix generating the
same code.

*** Proof
Let $(e_j)$ be the standard basis vectors in $\BB^k$. The code generated by $G$ is just
the image $C=G\BB^k$ of $G$ which in turn is given by all linear combinations of
$(Ge_j)$. Let $G'$ be the generator found by adding column $k$ to column $l\neq\?k$.

We have to show that $C=G'\BB^k$. For this in turn it suffices to show that $(G'e_j)$
spans $C$. First of all observe that

$$
  Ge_j = G'e_j \text{ for } j \neq l .
$$

Hence it suffices to show that $\{Ge_k,Ge_l\}$ spans the same space as
$\{G'e_k,G'e_l\}$. Observe that

\begin{align*}
  G' e_l &= Ge_k + Ge_l , \\
  G e_l &= G'e_k + G'e_l .
\end{align*}

This shows the claim. QED.

