chapter_10.html

<div id="outline-container-org825fae1" class="outline-3">
<h3 id="org825fae1">Exercise 10.12</h3>
<div class="outline-text-3" id="text-org825fae1">
<p>
Show that the fidelity between the state \(\ket{0}\) and \(\calE(\proj{0})\) is \(\sqrt{1-2p/3}\)
and use this to argue that the minimum fidelity for the depolarizing channel is
\(\sqrt{1-2p/3}\).
</p>
</div>

<div id="outline-container-orgfc8dd14" class="outline-4">
<h4 id="orgfc8dd14">Solution 1</h4>
<div class="outline-text-4" id="text-orgfc8dd14">
<p>
Let us follow the hint of the book.
</p>

<p>
\[
  F(\ket{0}, \calE(\proj{0}))
  = \sqrt{(1-p) + \frac{p}{3}(\bra{0}X\ket{0}^2 + \bra{0}Y\ket{0}^2 + \bra{0}Z\ket{0}^2)}
  = \sqrt{(1-p) + \frac{p}{3}}
  = \sqrt{1-\frac{2p}{3}} .
\]
</p>

<p>
Let \(\ket{\psi}\) be an arbitrary state and \(U\) be a unitary operator such that
\(\ket{\psi}=U\ket{0}\). Then
</p>

<p>
\[
  F(\ket{\psi}, \calE(\proj{\psi})) = F(U\ket{0}, U\calE(\proj{0})U^\dagger)
  = F(\ket{0}, \calE(\proj{0})) = \sqrt{1-\frac{2p}{3}} .
\]
</p>

<p>
In the second equality we used that the fidelity is invariant under unitary transformations.
</p>
</div>
</div>

<div id="outline-container-org38f0b83" class="outline-4">
<h4 id="org38f0b83">Solution 2</h4>
<div class="outline-text-4" id="text-org38f0b83">
<p>
We could also prove the claim by using an alternative formula for the depolarizing channel:
</p>

<p>
\[
  \calE(\rho) = \frac{2p}{3} I + \left(1 - \frac{4p}{3}\right) \rho .
\]
</p>

<p>
(compare equations (8.100) and (8.102).) Hence
</p>

<p>
\[
  F(\ket{\psi}, \calE(\proj{\psi})) = \sqrt{\frac{2p}{3} + \left(1 - \frac{4p}{3}\right)}
  = \sqrt{1-\frac{2p}{3}} .
\]
</p>
</div>
</div>

<div id="outline-container-orgfd62465" class="outline-4">
<h4 id="orgfd62465">Solution 3</h4>
<div class="outline-text-4" id="text-orgfd62465">
<p>
Yet another approach first calculates
</p>

<p>
\[
  F(\ket{\psi}, \calE(\proj{\psi}))
  = \sqrt{(1-p) + \frac{p}{3}(\bra{\psi}X\ket{\psi}^2 + \bra{\psi}Y\ket{\psi}^2 + \bra{\psi}Z\ket{\psi}^2)} .
\]
</p>

<p>
Recall the representation \(\proj{\psi}=2\inv(I+\vec{r}\cdot\vec{\sigma})\) of a qubit in
the bloch sphere (\(\abs{\vec{r}}=1\)). One can show that
</p>

<p>
\[
  \bra{\psi}Z\ket{\psi} = r_z
\]
</p>

<p>
and analogous formulas for \(r_x\) and \(r_y\). Hence
</p>

<p>
\[
  F(\ket{\psi}, \calE(\proj{\psi})) = \sqrt{(1-p) + \frac{p}{3}\abs{\vec{r}}^2} = \sqrt{1-\frac{2p}{3}} .
\]
</p>

<dl class="org-dl">
<dt>Remark</dt><dd><p>
To see e.g.
</p>

<p>
\[
  \bra{\psi}Z\ket{\psi} = r_z
  \]
</p>

<p>
observe that
</p>

<p>
\[
  \bra{\psi}Z\ket{\psi} = \trace{\proj{\psi}Z} = r_z .
  \]
</p>

<p>
In the last equality we used that the Pauli matrices (including \(I\)) are an orthogonal
set with respect to the Hilbert-Schmidt scalar product (with norm \(\sqrt{2}\) for each
base vector). The other two formulas for \(r_x\) and \(r_y\) follow along the same lines.
</p>

<p>
If you want to see the last equality directly, observe that (using \(S=\sqrt{Z}\))
</p>

<p>
\[
  \trace{\proj{\psi}Z} = \trace{S\proj{\psi}S}
  \]
</p>

<p>
and use \(SIS=Z\), \(SXS=\ii\?X\), \(SYS=\ii\?Y\), \(SZS=I\) (only the last term has a non-zero
trace).
</p></dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-org60f6085" class="outline-3">
<h3 id="org60f6085">Exercise 10.13</h3>
<div class="outline-text-3" id="text-org60f6085">
<p>
Show that the minimum fidelity \(F(\ket{\psi},\calE(\proj{\psi}))\) when \(\calE\) is the
amplitude damping channel with parameter \(\gamma\), is \(\sqrt{1-\gamma}\).
</p>
</div>

<div id="outline-container-org4392eab" class="outline-4">
<h4 id="org4392eab">Proof</h4>
<div class="outline-text-4" id="text-org4392eab">
<p>
Let us use sage to get an algebraic expression for \(F\). First define amplitude damping
</p>

<div class="org-src-container">
<pre class="src src-sage"><span class="org-variable-name">E0</span> <span class="org-operator">=</span> matrix.diagonal([1, sqrt(1<span class="org-operator">-</span>g)])
<span class="org-variable-name">E1</span> <span class="org-operator">=</span> matrix([[0, sqrt(g)], [0, 0]])
<span class="org-variable-name">AD</span> <span class="org-operator">=</span> make_operation([E0, E1])
</pre>
</div>

<p>
Now we can use this to compute \(F\):
</p>

<div class="org-src-container">
<pre class="src src-sage"><span class="org-variable-name">psi</span> <span class="org-operator">=</span> a<span class="org-operator">*</span>ket(<span class="org-string">'0'</span>) <span class="org-operator">+</span> b<span class="org-operator">*</span>ket(<span class="org-string">'1'</span>)
<span class="org-variable-name">psi_mat</span> <span class="org-operator">=</span> matrix(psi).T
<span class="org-variable-name">rho</span> <span class="org-operator">=</span> AD(psi_mat<span class="org-operator">*</span>psi_mat.H).simplify_full()
(psi.conjugate() <span class="org-operator">*</span> rho <span class="org-operator">*</span> psi).simplify_full()
</pre>
</div>

<pre class="example">
2*a*b*sqrt(-g + 1)*conjugate(a)*conjugate(b) + a^2*conjugate(a)^2 + b^2*conjugate(b)^2 + (a*b*conjugate(a)*conjugate(b) - b^2*conjugate(b)^2)*g
</pre>


<p>
This looks a bit ugly so let us rewrite this:
</p>

<p>
\[
  F = \abs{a}^4 + \abs{b}^4 + \gamma(\abs{a}^2 \abs{b}^2 - \abs{b}^4) + 2\sqrt{1-\gamma}\, \abs{a}^2\abs{b}^2 .
\]
</p>

<p>
Substituting \(x=\abs{a}^2\) and \(y=\abs{b}^2\) this can be written as:
</p>

<p>
\[
  F = \sqrt{f(x,y)} = \sqrt{x^2 + y^2 + \gamma (xy - y^2) + 2\sqrt{1-\gamma} \, xy} ,
\]
</p>

<p>
under the constraint \(x+y=1\) and \(x,y\geq0\). Thus we have to solve a constrained
minimization problem. There are two possibilities. The first one is that the minimum
occurs at the boundaries of the feasible region. Therefore let us calculate
</p>

\begin{align*}
  f(1,0) &= 1 , \\
  f(0,1) &= 1 - \gamma .
\end{align*}

<p>
The second possibility is that the minimum occurs in the inside of the feasible region. In
that case we might try to find it by the method of Lagrange multipliers:
</p>

\begin{align*}
  \partial_x f(x, y) &= 2x + (\gamma + 2\sqrt{1-\gamma}) y = \lambda \cdot 1 , \\
  \partial_y f(x, y) &= 2(1-\gamma)y + (\gamma + 2\sqrt{1-\gamma}) x = \lambda \cdot 1 .
\end{align*}

<p>
This looks a bit complicated so let us change the strategy a bit by defining a
parameterization of the feasible region
</p>

<p>
\[
  g(s) = f(s,1-s) .
\]
</p>

<p>
Abbreviating \(\alpha=\gamma+2\sqrt{1-\gamma}\) we see that
</p>

\begin{align*}
  g'(s) &= \partial_x f(s,1-s) - \partial_y f(s,1-s) \\
  &= (\alpha + 2\gamma - 2) - 2(\gamma + \alpha - 2) s \\
  &=: c_0 - c_1 s .
\end{align*}

<p>
Observe that \(\alpha+\gamma\geq2\). Hence \(c_0,c_1\geq0\) which implies that there is a
\(s_0\geq0\) such that \(g\) is increasing for \(s\leq\?s_0\) and decreasing afterwards (note
also that \(s_0\) could be larger than \(1\)). Hence a local extremum can only be a local
maximum and the minimum is indeed obtained at the boundary:
</p>

<p>
\[
  f(0, 1) = g(0) = 1 - \gamma .
\]
</p>

<p>
Hence \(F_{\min}=\sqrt{1-\gamma}\) . QED.
</p>
</div>
</div>
</div>

<div id="outline-container-org7010622" class="outline-3">
<h3 id="org7010622">Exercise 10.14</h3>
<div class="outline-text-3" id="text-org7010622">
<p>
Write an expression for a generator matrix encoding \(k\) bits using \(r\) repetitions for
each bit. This is an \([rk,k]\) linear code, and should have an \(rk\times\?k\) generator
matrix.
</p>
</div>

<div id="outline-container-exercise-10.14-solution" class="outline-4">
<h4 id="exercise-10.14-solution">Solution</h4>
<div class="outline-text-4" id="text-exercise-10.14-solution">
<p>
Let \(\mathbb{1}_r\in\?\BB^r\) be the vector containing just ones. A generator for this code
is given by the tensor product
</p>

<p>
\[
  G = I_k \otimes \mathbb{1}_r .
\]
</p>

<p>
This naturally reproduces the special cases \(r=3\), \(k\in\{1,2\}\) from the book.
</p>
</div>
</div>
</div>

<div id="outline-container-org105c761" class="outline-3">
<h3 id="org105c761">Exercise 10.15</h3>
<div class="outline-text-3" id="text-org105c761">
<p>
Show that adding one column of \(G\) to another results in a generator matrix generating the
same code.
</p>
</div>

<div id="outline-container-org4f59cb5" class="outline-4">
<h4 id="org4f59cb5">Proof</h4>
<div class="outline-text-4" id="text-org4f59cb5">
<p>
Let \((e_j)\) be the standard basis vectors in \(\BB^k\). The code generated by \(G\) is just
the image \(C=G\BB^k\) of \(G\) which in turn is given by all linear combinations of
\((Ge_j)\). Let \(G'\) be the generator found by adding column \(k\) to column \(l\neq\?k\).
</p>

<p>
We have to show that \(C=G'\BB^k\). For this in turn it suffices to show that \((G'e_j)\)
spans \(C\). First of all observe that
</p>

<p>
\[
  Ge_j = G'e_j \text{ for } j \neq l .
\]
</p>

<p>
Hence it suffices to show that \(\{Ge_k,Ge_l\}\) spans the same space as
\(\{G'e_k,G'e_l\}\). Observe that
</p>

\begin{align*}
  G' e_l &= Ge_k + Ge_l , \\
  G e_l &= G'e_k + G'e_l .
\end{align*}

<p>
This shows the claim. QED.
</p>
</div>
</div>
</div>
