src/chapter_10.org
** Exercise 10.16
Show that adding one row of the parity check matrix to another does not change the
code. Using Gaussian elimination and swapping of bits it is therefore possible to assume
that the parity check matrix has the standard form $[A|I_{n-k}]$, where $A$ is an
$(n-k)\times\?k$ matrix.

*** Proof
Recall that a code $C$, in terms of a parity check matrix $H$, is defined as

$$
  y \in C \Leftrightarrow \forall i: \sum_j H_{ij} y_j = 0 .
$$

Let $H'$ be a matrix obtained from $H$ by adding row $k$ to row $l$. Let $C'$ be the code
defined by $H'$. We have to show $C'=C$. Let $y\in\?C$. Then we have

$$
  \forall i\neq l: \sum_j H'_{ij} y_j = 0 .
$$

because for those $i$ we have $H'_{ij}=H_{ij}$. Moreover

$$
  \sum_j H'_{lj} y_j = \sum_j H_{kj} y_j + \sum_j H_{lj} y_j =  0 ,
$$

by definition of $H'$. Hence $y\in\?C'$. Since $y\in\?C$ was arbitrary this shows
$C\subseteq\?C'$. By symmetry we also have $C'\subseteq\?C$. In fact, $H$ can be obtained
from $H'$ by adding row $k$ to line $l$ so the same reasoning applies to the reverse
inclusion. QED.

** Exercise 10.17
Find a parity check matrix for the $[6,2]$ repetition code defined by the generator matrix in
(10.54).

\begin{bmatrix}
1 & 0 \\
1 & 0 \\
1 & 0 \\
0 & 1 \\
0 & 1 \\
0 & 1 \\
\end{bmatrix}

*** Solution
Let $G_1$ and $H_1$ be the generator and parity check matrix for $k=1$ bits (see equations
(10.53) and (10.58)). We have

$$
  G_2 = I_2 \otimes G_1 .
$$

(C.f. the [[#exercise-10.14-solution][solution]] of exercise 10.14.) This suggests to define

$$
  H_2 = I_2 \otimes H_1 = \begin{bmatrix}
    1 & 1 & 0 & 0 & 0 & 0 \\
    0 & 1 & 1 & 0 & 0 & 0 \\
    0 & 0 & 0 & 1 & 1 & 0 \\
    0 & 0 & 0 & 0 & 1 & 1
  \?\end{bmatrix} .
$$

This clearly does the job. It makes sense to compare this to [[#exercise-10.18][exercise 10.18]].

** Exercise 10.18
:PROPERTIES:
:CUSTOM_ID: exercise-10.18
:END:
Show that the parity check matrix $H$ and generator matrix $G$ for the same linear code
satisfy $HG=0$.

*** Proof
Recall that a code $C$ is just the image of the generator $C=G\BB^k$. On the other hand it
can be defined as the kernel of the parity check matrix: $C=\{y|Hy=0\}$. Since every code
word has the form $y=Gx$ we see that $HGx=0$ for every $x$. Hence the claim follows. QED.

** Exercise 10.19
Suppose an $[n,k]$ linear code $C$ has a parity check matrix of the form $H=[A|I_{n-k}]$,
for some $(n-k)\times\?k$ matrix $A$. Show that the corresponding generator matrix is

$$
  G = \left[ \begin{array}{c} I_k \\ \hline -A \end{array} \right]
$$

(Note that $-A=A$ since we are working modulo 2; however, this equation also holds for
linear codes over more general ﬁelds than $\ZZ_2$.)

*** Solution
Clearly $G$ has rank $k$. Hence its images has the same dimension as the kernel of $H$
(which is $k$). We only have to verify that $HG=0$ (c.f. [[#exercise-10.18][exercise 10.18]]). But this is
easy:

$$
  HG = A I_k - I_{n-k} A = A - A = 0 .
$$

** Exercise 10.20
:PROPERTIES:
:CUSTOM_ID: exercise-10.20
:END:
Let $H$ be a parity check matrix such that any $d-1$ columns are linearly independent, but
there exists a set of $d$ linearly dependent columns. Show that the code defined by $H$
has distance $d$.

*** Proof
Let us divide the proof into two parts. In part one we assume that $H$ has $d$ linearly
/dependent/ columns. In part two we assume that every $d-1$ columns are linearly
/independent/.

- Part 1 :: Assume that $H$ has $d$ linearly /dependent/ columns $c_1,\ldots,c_d$. We want
  to show that there exists a $y\in\?C$ (i.e. $y\in\BB^n$ such that $Hy=0$) with
  $\wt{y}\leq\?d$.

  Linear dependence means that there exist coefficients $\alpha_i\in\BB$ such that

  $$
  0 = \sum_i \alpha_i c_i .
  $$

  Without loss of generality we may assume that all $\alpha_i$ are equal to $1$. Otherwise
  there would exist a subset of $d'\?<\?d$ columns such that this is fulfilled.

  Let $J=\{i_1,\ldots,i_d\}$ be the indices of these columns in $H$. Let $y\in\BB^n$ be
  such that $y_i=1$ if $i\in\?J$ and $y_i=0$ otherwise. By construction we have $\wt{y}=d$
  and $Hy=0$. This shows the claim of part 1.
- Part 2 :: Assume that every $d-1$ columns are linearly /independent/. We have to show
  that $Hy=0$ implies $\wt{y}\geq\?d$.

  The assumption implies that every for every $y$ with $\wt{y}\leq\?d-1$ we have
  $Hy\neq0$. But this is equivalent to the claim.

Taking parts 1 and 2 together we see that $d(C)=d$ is equivalent to: Any $d-1$ columns of
$H$ are linearly independent but there exist $d$ columns which are linearly
dependent. QED.

** Exercise 10.21 (Singleton bound)
Show that an $[n,k,d]$ code must satisfy $n-k\geq\?d-1$.

*** Proof
This follows directly from [[#exercise-10.20][exercise 10.20]]. In fact, the parity check matrix
$H\in\BB^{(n-k)\times\?n}$ of the code must have full rank $n-k$ in order for the code
space to be $k$​-dimensional (otherwise it would be bigger and there could be no bijection
between the code words and the elements of $\BB^k$).

On the other hand, from $d(C)=d$, using exercise 10.20, we see that the rank of $H$ must
be at least $d-1$. Hence $n-k\geq\?d-1$. QED.

** Exercise 10.22
Show that all Hamming codes have distance $3$, and thus can correct an error on a single
bit. The Hamming codes are therefore $[2^r-1,2^r-r-1,3]$ codes.

*** Proof
The parity check matrix of the Hamming code is made of matrices with columns $h_j$ being
the binary representation of $j$ for $j\in\{1,\ldots,2^r-1\}$. Hence

$$
  h_1 + h_2 = h_3 ,
$$

implying that the first three columns are linearly dependent. On the other hand any two
columns are linearly independent since

$$
  h_i + h_j = 0
$$

implies $i=j$. Now the claim follows from [[#exercise-10.20][exercise 10.20]]. QED.

