chapter_10.html

<div id="outline-container-org5d58e76" class="outline-3">
<h3 id="org5d58e76">Exercise 10.16</h3>
<div class="outline-text-3" id="text-org5d58e76">
<p>
Show that adding one row of the parity check matrix to another does not change the
code. Using Gaussian elimination and swapping of bits it is therefore possible to assume
that the parity check matrix has the standard form \([A|I_{n-k}]\), where \(A\) is an
\((n-k)\times\?k\) matrix.
</p>
</div>

<div id="outline-container-org2cdc9a2" class="outline-4">
<h4 id="org2cdc9a2">Proof</h4>
<div class="outline-text-4" id="text-org2cdc9a2">
<p>
Recall that a code \(C\), in terms of a parity check matrix \(H\), is defined as
</p>

<p>
\[
  y \in C \Leftrightarrow \forall i: \sum_j H_{ij} y_j = 0 .
\]
</p>

<p>
Let \(H'\) be a matrix obtained from \(H\) by adding row \(k\) to row \(l\). Let \(C'\) be the code
defined by \(H'\). We have to show \(C'=C\). Let \(y\in\?C\). Then we have
</p>

<p>
\[
  \forall i\neq l: \sum_j H'_{ij} y_j = 0 .
\]
</p>

<p>
because for those \(i\) we have \(H'_{ij}=H_{ij}\). Moreover
</p>

<p>
\[
  \sum_j H'_{lj} y_j = \sum_j H_{kj} y_j + \sum_j H_{lj} y_j =  0 ,
\]
</p>

<p>
by definition of \(H'\). Hence \(y\in\?C'\). Since \(y\in\?C\) was arbitrary this shows
\(C\subseteq\?C'\). By symmetry we also have \(C'\subseteq\?C\). In fact, \(H\) can be obtained
from \(H'\) by adding row \(k\) to line \(l\) so the same reasoning applies to the reverse
inclusion. QED.
</p>
</div>
</div>
</div>

<div id="outline-container-org0e5d0f6" class="outline-3">
<h3 id="org0e5d0f6">Exercise 10.17</h3>
<div class="outline-text-3" id="text-org0e5d0f6">
<p>
Find a parity check matrix for the \([6,2]\) repetition code defined by the generator matrix in
(10.54).
</p>

\begin{bmatrix}
1 & 0 \\
1 & 0 \\
1 & 0 \\
0 & 1 \\
0 & 1 \\
0 & 1 \\
\end{bmatrix}
</div>

<div id="outline-container-org25d85d8" class="outline-4">
<h4 id="org25d85d8">Solution</h4>
<div class="outline-text-4" id="text-org25d85d8">
<p>
Let \(G_1\) and \(H_1\) be the generator and parity check matrix for \(k=1\) bits (see equations
(10.53) and (10.58)). We have
</p>

<p>
\[
  G_2 = I_2 \otimes G_1 .
\]
</p>

<p>
(C.f. the <a href="#exercise-10.14-solution">solution</a> of exercise 10.14.) This suggests to define
</p>

<p>
\[
  H_2 = I_2 \otimes H_1 = \begin{bmatrix}
    1 & 1 & 0 & 0 & 0 & 0 \\
    0 & 1 & 1 & 0 & 0 & 0 \\
    0 & 0 & 0 & 1 & 1 & 0 \\
    0 & 0 & 0 & 0 & 1 & 1
  \?\end{bmatrix} .
\]
</p>

<p>
This clearly does the job. It makes sense to compare this to <a href="#exercise-10.18">exercise 10.18</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-exercise-10.18" class="outline-3">
<h3 id="exercise-10.18">Exercise 10.18</h3>
<div class="outline-text-3" id="text-exercise-10.18">
<p>
Show that the parity check matrix \(H\) and generator matrix \(G\) for the same linear code
satisfy \(HG=0\).
</p>
</div>

<div id="outline-container-org47d5dfb" class="outline-4">
<h4 id="org47d5dfb">Proof</h4>
<div class="outline-text-4" id="text-org47d5dfb">
<p>
Recall that a code \(C\) is just the image of the generator \(C=G\BB^k\). On the other hand it
can be defined as the kernel of the parity check matrix: \(C=\{y|Hy=0\}\). Since every code
word has the form \(y=Gx\) we see that \(HGx=0\) for every \(x\). Hence the claim follows. QED.
</p>
</div>
</div>
</div>

<div id="outline-container-orge6ab650" class="outline-3">
<h3 id="orge6ab650">Exercise 10.19</h3>
<div class="outline-text-3" id="text-orge6ab650">
<p>
Suppose an \([n,k]\) linear code \(C\) has a parity check matrix of the form \(H=[A|I_{n-k}]\),
for some \((n-k)\times\?k\) matrix \(A\). Show that the corresponding generator matrix is
</p>

<p>
\[
  G = \left[ \begin{array}{c} I_k \\ \hline -A \end{array} \right]
\]
</p>

<p>
(Note that \(-A=A\) since we are working modulo 2; however, this equation also holds for
linear codes over more general ﬁelds than \(\ZZ_2\).)
</p>
</div>

<div id="outline-container-org51006c8" class="outline-4">
<h4 id="org51006c8">Solution</h4>
<div class="outline-text-4" id="text-org51006c8">
<p>
Clearly \(G\) has rank \(k\). Hence its images has the same dimension as the kernel of \(H\)
(which is \(k\)). We only have to verify that \(HG=0\) (c.f. <a href="#exercise-10.18">exercise 10.18</a>). But this is
easy:
</p>

<p>
\[
  HG = A I_k - I_{n-k} A = A - A = 0 .
\]
</p>
</div>
</div>
</div>

<div id="outline-container-exercise-10.20" class="outline-3">
<h3 id="exercise-10.20">Exercise 10.20</h3>
<div class="outline-text-3" id="text-exercise-10.20">
<p>
Let \(H\) be a parity check matrix such that any \(d-1\) columns are linearly independent, but
there exists a set of \(d\) linearly dependent columns. Show that the code defined by \(H\)
has distance \(d\).
</p>
</div>

<div id="outline-container-org160dcc4" class="outline-4">
<h4 id="org160dcc4">Proof</h4>
<div class="outline-text-4" id="text-org160dcc4">
<p>
Let us divide the proof into two parts. In part one we assume that \(H\) has \(d\) linearly
<i>dependent</i> columns. In part two we assume that every \(d-1\) columns are linearly
<i>independent</i>.
</p>

<dl class="org-dl">
<dt>Part 1</dt><dd><p>
Assume that \(H\) has \(d\) linearly <i>dependent</i> columns \(c_1,\ldots,c_d\). We want
to show that there exists a \(y\in\?C\) (i.e. \(y\in\BB^n\) such that \(Hy=0\)) with
\(\wt{y}\leq\?d\).
</p>

<p>
Linear dependence means that there exist coefficients \(\alpha_i\in\BB\) such that
</p>

<p>
\[
  0 = \sum_i \alpha_i c_i .
  \]
</p>

<p>
Without loss of generality we may assume that all \(\alpha_i\) are equal to \(1\). Otherwise
there would exist a subset of \(d'\?<\?d\) columns such that this is fulfilled.
</p>

<p>
Let \(J=\{i_1,\ldots,i_d\}\) be the indices of these columns in \(H\). Let \(y\in\BB^n\) be
such that \(y_i=1\) if \(i\in\?J\) and \(y_i=0\) otherwise. By construction we have \(\wt{y}=d\)
and \(Hy=0\). This shows the claim of part 1.
</p></dd>
<dt>Part 2</dt><dd><p>
Assume that every \(d-1\) columns are linearly <i>independent</i>. We have to show
that \(Hy=0\) implies \(\wt{y}\geq\?d\).
</p>

<p>
The assumption implies that every for every \(y\) with \(\wt{y}\leq\?d-1\) we have
\(Hy\neq0\). But this is equivalent to the claim.
</p></dd>
</dl>

<p>
Taking parts 1 and 2 together we see that \(d(C)=d\) is equivalent to: Any \(d-1\) columns of
\(H\) are linearly independent but there exist \(d\) columns which are linearly
dependent. QED.
</p>
</div>
</div>
</div>

<div id="outline-container-orgbc8313c" class="outline-3">
<h3 id="orgbc8313c">Exercise 10.21 (Singleton bound)</h3>
<div class="outline-text-3" id="text-orgbc8313c">
<p>
Show that an \([n,k,d]\) code must satisfy \(n-k\geq\?d-1\).
</p>
</div>

<div id="outline-container-org4d91826" class="outline-4">
<h4 id="org4d91826">Proof</h4>
<div class="outline-text-4" id="text-org4d91826">
<p>
This follows directly from <a href="#exercise-10.20">exercise 10.20</a>. In fact, the parity check matrix
\(H\in\BB^{(n-k)\times\?n}\) of the code must have full rank \(n-k\) in order for the code
space to be \(k\)​-dimensional (otherwise it would be bigger and there could be no bijection
between the code words and the elements of \(\BB^k\)).
</p>

<p>
On the other hand, from \(d(C)=d\), using exercise 10.20, we see that the rank of \(H\) must
be at least \(d-1\). Hence \(n-k\geq\?d-1\). QED.
</p>
</div>
</div>
</div>

<div id="outline-container-org6b9b72b" class="outline-3">
<h3 id="org6b9b72b">Exercise 10.22</h3>
<div class="outline-text-3" id="text-org6b9b72b">
<p>
Show that all Hamming codes have distance \(3\), and thus can correct an error on a single
bit. The Hamming codes are therefore \([2^r-1,2^r-r-1,3]\) codes.
</p>
</div>

<div id="outline-container-orgcfb5a6d" class="outline-4">
<h4 id="orgcfb5a6d">Proof</h4>
<div class="outline-text-4" id="text-orgcfb5a6d">
<p>
The parity check matrix of the Hamming code is made of matrices with columns \(h_j\) being
the binary representation of \(j\) for \(j\in\{1,\ldots,2^r-1\}\). Hence
</p>

<p>
\[
  h_1 + h_2 = h_3 ,
\]
</p>

<p>
implying that the first three columns are linearly dependent. On the other hand any two
columns are linearly independent since
</p>

<p>
\[
  h_i + h_j = 0
\]
</p>

<p>
implies \(i=j\). Now the claim follows from <a href="#exercise-10.20">exercise 10.20</a>. QED.
</p>
</div>
</div>
</div>
