chapter_10.html

<div id="outline-container-org77c7790" class="outline-4">
<h4 id="org77c7790">Proof</h4>
<div class="outline-text-4" id="text-org77c7790">
<p>
By definition of dual codes we have \(x\cdot\?y=0\) if \(x\in\?C^\bot\) and \(y\in\?C\). Hence,
in that case
</p>

<p>
\[
  \sum_{y\in\?C}(-1)^{x\cdot y} = \sum_{y\in\?C} 1 = \abs{C}
\]
</p>

<p>
Assume now that \(x\in\?C^\bot\). Hence there exists a \(\tilde{y}\in\?C\) such that
\(x\cdot\?\tilde{y}=1\). Let us decompose \(C=C'\oplus\?\tilde{y}\BB\). Hence
</p>

<p>
\[
  \sum_{y\in C}(-1)^{x\cdot y}
  = \sum_{y'\in C'} \sum_{\alpha=0}^1 (-1)^{y'\cdot x + \alpha\tilde{y}\cdot x}
  = \sum_{y'\in C'} 0
  = 0 .
\]
</p>

<p>
QED.
</p>
</div>
</div>
</div>

<div id="outline-container-org25be67e" class="outline-3">
<h3 id="org25be67e">Exercise 10.26</h3>
<div class="outline-text-3" id="text-org25be67e">
<p>
Suppose \(H\) is a parity check matrix. Explain how to compute the transformation
\(\ket{x}\ket{0}\mapsto\ket{x}\ket{Hx}\) using a circuit composed entirely of <code>CNOT</code> gates.
</p>
</div>

<div id="outline-container-org5213b56" class="outline-4">
<h4 id="org5213b56">Solution</h4>
<div class="outline-text-4" id="text-org5213b56">
<p>
Let us explain it on the specific example of the \([3,1]\) repetition code:
</p>

<p>
\[
  H = \begin{bmatrix} 1 & 1 & 0 \\ 0 & 1 & 1 \end{bmatrix} .
\]
</p>

<p>
A corresponding circuit would be
</p>

<pre class="example" id="orge5b825f">

a_0: ──■─────────────────
       │
a_1: ──┼────■────■───────
       │    │    │
a_2: ──┼────┼────┼────■──
     ┌─┴─┐┌─┴─┐  │    │
b_0: ┤ X ├┤ X ├──┼────┼──
     └───┘└───┘┌─┴─┐┌─┴─┐
b_1: ──────────┤ X ├┤ X ├
               └───┘└───┘
</pre>

<p>
The idea is that for each \((i,j)\) with \(H_{ij}=1\) we have a <code>CNOT</code> with control at target
\(b_i\) and control \(a_j\).
</p>
</div>
</div>
</div>

<div id="outline-container-org1499e14" class="outline-3">
<h3 id="org1499e14">Exercise 10.27</h3>
<div class="outline-text-3" id="text-org1499e14">
<p>
Show that the codes defined by
</p>

<p>
\[
  \ket{x+C_2} = \frac{1}{\sqrt{\abs{C_2}}} \sum_{y\in\?C_2} (-1)^{u\cdot y} \ket{x+y+v}
\]
</p>

<p>
and parameterized by \(u\) and \(v\) are equivalent to \(\mathrm{CSS}(C_1,C_2)\) in the sense
that they have the same error-correcting properties. These codes, which we’ll refer to as
\(\mathrm{CSS}_{u,v}(C_1,C_2)\), will be useful later in our study of quantum key
distribution, in Section 12.6.5.
</p>
</div>

<div id="outline-container-orgd0b76a4" class="outline-4">
<h4 id="orgd0b76a4">Sketch of a solution</h4>
<div class="outline-text-4" id="text-orgd0b76a4">
<p>
By using \(X\), \(Z\), and Hadamard gates one can unitarily transform the code into the
following form
</p>

<p>
\[
  \ket{x+C_2} = \frac{1}{\sqrt{\abs{C_2}}} \sum_{y\in\?C_2} (-1)^{u\cdot x} \ket{x+y}
  = (-1)^{u\cdot x} \frac{1}{\sqrt{\abs{C_2}}} \sum_{y\in\?C_2} \ket{x+y} .
\]
</p>

<p>
Basically we introduce errors \(e_1=v\) and \(e_2=u\) on purpose to accomplish that. Now it is
not hard to verify that the factor \((-1)^{u\cdot\?x}\) does not interfere with the analysis
from the book.
</p>
</div>
</div>
</div>

<div id="outline-container-org1586e6c" class="outline-3">
<h3 id="org1586e6c">Exercise 10.28</h3>
<div class="outline-text-3" id="text-org1586e6c">
<p>
Verify that the transpose of the matrix in (10.77) is the generator of the \([7,4,3]\)
Hamming code.
</p>
</div>

<div id="outline-container-org32277f0" class="outline-4">
<h4 id="org32277f0">Solution</h4>
<div class="outline-text-4" id="text-org32277f0">
<p>
The claim follows essentially from the following calculation:
</p>

<div class="org-src-container">
<pre class="src src-sage"><span class="org-comment-delimiter"># </span><span class="org-comment">Standard parity check matrix for the [7,3] Hamming code:</span>
<span class="org-variable-name">H</span> <span class="org-operator">=</span> matrix(GF(2), [
    [0, 0, 0, 1, 1, 1, 1],
    [0, 1, 1, 0, 0, 1, 1],
    [1, 0, 1, 0, 1, 0, 1],
])

<span class="org-comment-delimiter"># </span><span class="org-comment">We want to check that this is indeed a generator:</span>
<span class="org-variable-name">G</span> <span class="org-operator">=</span> matrix(GF(2), [
    [1, 0, 0, 0, 0, 1, 1],
    [0, 1, 0, 0, 1, 0, 1],
    [0, 0, 1, 0, 1, 1, 0],
    [0, 0, 0, 1, 1, 1, 1],
]).T

<span class="org-keyword">assert</span> H<span class="org-operator">*</span>G <span class="org-operator">==</span> matrix.zero(3, 4)
<span class="org-string">"PASSED"</span>
</pre>
</div>

<pre class="example">
'PASSED'
</pre>


<p>
One important thing to note is that \(G\) has full rank (obviously). Hence \(HG=0\) is
sufficient to prove \(G\) to be a generator of the \([7,4]\) Hamming code.
</p>
</div>
</div>
</div>
</div>
<footer class="footer"><p>Made by <a href="https://github.com/rainij">Reinhard Stahn</a> with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1.50 (<a href="https://orgmode.org">Org</a> mode 9.6.9)</p><p>Find the source code on <a href="https://github.com/rainij/solutions-qcqi-nielsen-chuang">Github</a></p></footer></body></html>